tutorials/heatTransfer/buoyantBoussinesqSimpleSolver/hotRoom/0/epsilon
/*---------------------------------------------------------------------------*
Caelus 4.10
Web:   www.caelus-cml.com
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      epsilon;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -3 0 0 0 0];

internalField   uniform 0.01;

boundaryField
{
    floor
    {
        type            epsilonWallFunction;
        value           uniform 0.01;
    }
    ceiling
    {
        type            epsilonWallFunction;
        value           uniform 0.01;
    }
    fixedWalls
    {
        type            epsilonWallFunction;
        value           uniform 0.01;
    }
}


// ************************************************************************* //
