tutorials/heatTransfer/buoyantBoussinesqSimpleSolver/hotRoom/0/kappat
/*---------------------------------------------------------------------------*
Caelus 4.10
Web:   www.caelus-cml.com
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      kappat;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -1 0 0 0 0];

internalField   uniform 0;

boundaryField
{
    floor
    {
        type            kappatJayatillekeWallFunction;
        Prt             0.85;
        value           uniform 0;
    }
    ceiling
    {
        type            kappatJayatillekeWallFunction;
        Prt             0.85;
        value           uniform 0;
    }
    fixedWalls
    {
        type            kappatJayatillekeWallFunction;
        Prt             0.85;
        value           uniform 0;
    }
}


// ************************************************************************* //
